WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/include/hal_com_reg.h
#define RRSR_CCK_RATES (RRSR_11M|RRSR_5_5M|RRSR_2M|RRSR_1M)
#define RRSR_OFDM_RATES (RRSR_54M|RRSR_48M|RRSR_36M|RRSR_24M|RRSR_18M|RRSR_12M|RRSR_9M|RRSR_6M)

// WOL bit information
#define HAL92C_WOL_PTK_UPDATE_EVENT		BIT0
#define HAL92C_WOL_GTK_UPDATE_EVENT		BIT1
#define HAL92C_WOL_DISASSOC_EVENT		BIT2
#define HAL92C_WOL_DEAUTH_EVENT			BIT3
#define HAL92C_WOL_FW_DISCONNECT_EVENT	BIT4

//----------------------------------------------------------------------------
//       Rate Definition
//----------------------------------------------------------------------------
//CCK
#define	RATR_1M					0x00000001
#define	RATR_2M					0x00000002
#define	RATR_55M					0x00000004
#define	RATR_11M					0x00000008
//OFDM
#define	RATR_6M					0x00000010
#define	RATR_9M					0x00000020
#define	RATR_12M					0x00000040
#define	RATR_18M					0x00000080
#define	RATR_24M					0x00000100
#define	RATR_36M					0x00000200
#define	RATR_48M					0x00000400
#define	RATR_54M					0x00000800
//MCS 1 Spatial Stream
#define	RATR_MCS0					0x00001000
#define	RATR_MCS1					0x00002000
#define	RATR_MCS2					0x00004000
#define	RATR_MCS3					0x00008000
#define	RATR_MCS4					0x00010000
#define	RATR_MCS5					0x00020000
#define	RATR_MCS6					0x00040000
#define	RATR_MCS7					0x00080000
//MCS 2 Spatial Stream
#define	RATR_MCS8					0x00100000
#define	RATR_MCS9					0x00200000
#define	RATR_MCS10					0x00400000
#define	RATR_MCS11					0x00800000
#define	RATR_MCS12					0x01000000
#define	RATR_MCS13					0x02000000
#define	RATR_MCS14					0x04000000
#define	RATR_MCS15					0x08000000

//CCK
#define RATE_1M					BIT(0)
#define RATE_2M					BIT(1)
#define RATE_5_5M				BIT(2)
#define RATE_11M				BIT(3)
//OFDM
#define RATE_6M					BIT(4)
#define RATE_9M					BIT(5)
#define RATE_12M				BIT(6)
#define RATE_18M				BIT(7)
#define RATE_24M				BIT(8)
#define RATE_36M				BIT(9)
#define RATE_48M				BIT(10)
#define RATE_54M				BIT(11)
//MCS 1 Spatial Stream
#define RATE_MCS0				BIT(12)
#define RATE_MCS1				BIT(13)
#define RATE_MCS2				BIT(14)
#define RATE_MCS3				BIT(15)
#define RATE_MCS4				BIT(16)
#define RATE_MCS5				BIT(17)
#define RATE_MCS6				BIT(18)
#define RATE_MCS7				BIT(19)
//MCS 2 Spatial Stream
#define RATE_MCS8				BIT(20)
#define RATE_MCS9				BIT(21)
#define RATE_MCS10				BIT(22)
#define RATE_MCS11				BIT(23)
#define RATE_MCS12				BIT(24)
#define RATE_MCS13				BIT(25)
#define RATE_MCS14				BIT(26)
#define RATE_MCS15				BIT(27)


// ALL CCK Rate
#define	RATE_ALL_CCK				RATR_1M|RATR_2M|RATR_55M|RATR_11M
#define	RATE_ALL_OFDM_AG			RATR_6M|RATR_9M|RATR_12M|RATR_18M|RATR_24M|\
						RATR_36M|RATR_48M|RATR_54M
#define	RATE_ALL_OFDM_1SS			RATR_MCS0|RATR_MCS1|RATR_MCS2|RATR_MCS3 |\
						RATR_MCS4|RATR_MCS5|RATR_MCS6	|RATR_MCS7
#define	RATE_ALL_OFDM_2SS			RATR_MCS8|RATR_MCS9	|RATR_MCS10|RATR_MCS11|\
						RATR_MCS12|RATR_MCS13|RATR_MCS14|RATR_MCS15

#define RATE_BITMAP_ALL			0xFFFFF

// Only use CCK 1M rate for ACK
#define RATE_RRSR_CCK_ONLY_1M		0xFFFF1
#define RATE_RRSR_WITHOUT_CCK		0xFFFF0

//----------------------------------------------------------------------------
//       BW_OPMODE bits				(Offset 0x603, 8bit)
//----------------------------------------------------------------------------
#define BW_OPMODE_20MHZ			BIT2
#define BW_OPMODE_5G				BIT1

//----------------------------------------------------------------------------
//       CAM Config Setting (offset 0x680, 1 byte)
//----------------------------------------------------------------------------
#define CAM_VALID				BIT15
#define CAM_NOTVALID			0x0000
#define CAM_USEDK				BIT5

#define CAM_CONTENT_COUNT 	8

#define CAM_NONE				0x0
#define CAM_WEP40				0x01
#define CAM_TKIP				0x02
#define CAM_AES					0x04
#define CAM_WEP104				0x05
#define CAM_SMS4				0x6

#define TOTAL_CAM_ENTRY		32
#define HALF_CAM_ENTRY			16

#define CAM_CONFIG_USEDK		_TRUE
#define CAM_CONFIG_NO_USEDK	_FALSE

#define CAM_WRITE				BIT16
#define CAM_READ				0x00000000
#define CAM_POLLINIG			BIT31

//
// 10. Power Save Control Registers
//
#define WOW_PMEN				BIT0 // Power management Enable.
#define WOW_WOMEN				BIT1 // WoW function on or off.
#define WOW_MAGIC				BIT2 // Magic packet
#define WOW_UWF				BIT3 // Unicast Wakeup frame.

//
// 12. Host Interrupt Status Registers
//
//----------------------------------------------------------------------------
//      8190 IMR/ISR bits
//----------------------------------------------------------------------------
#define IMR8190_DISABLED		0x0
#define IMR_DISABLED			0x0
// IMR DW0 Bit 0-31
#define IMR_BCNDMAINT6			BIT31		// Beacon DMA Interrupt 6
#define IMR_BCNDMAINT5			BIT30		// Beacon DMA Interrupt 5
#define IMR_BCNDMAINT4			BIT29		// Beacon DMA Interrupt 4
#define IMR_BCNDMAINT3			BIT28		// Beacon DMA Interrupt 3
#define IMR_BCNDMAINT2			BIT27		// Beacon DMA Interrupt 2
#define IMR_BCNDMAINT1			BIT26		// Beacon DMA Interrupt 1
#define IMR_BCNDOK8				BIT25		// Beacon Queue DMA OK Interrup 8
#define IMR_BCNDOK7				BIT24		// Beacon Queue DMA OK Interrup 7
#define IMR_BCNDOK6				BIT23		// Beacon Queue DMA OK Interrup 6
#define IMR_BCNDOK5				BIT22		// Beacon Queue DMA OK Interrup 5
#define IMR_BCNDOK4				BIT21		// Beacon Queue DMA OK Interrup 4
#define IMR_BCNDOK3				BIT20		// Beacon Queue DMA OK Interrup 3
#define IMR_BCNDOK2				BIT19		// Beacon Queue DMA OK Interrup 2
#define IMR_BCNDOK1				BIT18		// Beacon Queue DMA OK Interrup 1
#define IMR_TIMEOUT2			BIT17		// Timeout interrupt 2
#define IMR_TIMEOUT1			BIT16		// Timeout interrupt 1
#define IMR_TXFOVW				BIT15		// Transmit FIFO Overflow
#define IMR_PSTIMEOUT			BIT14		// Power save time out interrupt
#define IMR_BcnInt				BIT13		// Beacon DMA Interrupt 0
#define IMR_RXFOVW				BIT12		// Receive FIFO Overflow
#define IMR_RDU					BIT11		// Receive Descriptor Unavailable
#define IMR_ATIMEND				BIT10		// For 92C,ATIM Window End Interrupt. For 8723 and later ICs, it also means P2P CTWin End interrupt.
#define IMR_BDOK				BIT9		// Beacon Queue DMA OK Interrup
#define IMR_HIGHDOK				BIT8		// High Queue DMA OK Interrupt
#define IMR_TBDOK				BIT7		// Transmit Beacon OK interrup
#define IMR_MGNTDOK			BIT6		// Management Queue DMA OK Interrupt
#define IMR_TBDER				BIT5		// For 92C,Transmit Beacon Error Interrupt
#define IMR_BKDOK				BIT4		// AC_BK DMA OK Interrupt
#define IMR_BEDOK				BIT3		// AC_BE DMA OK Interrupt
#define IMR_VIDOK				BIT2		// AC_VI DMA OK Interrupt
#define IMR_VODOK				BIT1		// AC_VO DMA Interrupt
#define IMR_ROK					BIT0		// Receive DMA OK Interrupt

// 13. Host Interrupt Status Extension Register	 (Offset: 0x012C-012Eh)
#define IMR_TSF_BIT32_TOGGLE	BIT15
#define IMR_BcnInt_E				BIT12
#define IMR_TXERR				BIT11
#define IMR_RXERR				BIT10
#define IMR_C2HCMD				BIT9
#define IMR_CPWM				BIT8
//RSVD [2-7]
#define IMR_OCPINT				BIT1
#define IMR_WLANOFF			BIT0

//----------------------------------------------------------------------------
// 8723E series PCIE Host IMR/ISR bit
//----------------------------------------------------------------------------
// IMR DW0 Bit 0-31
#define PHIMR_TIMEOUT2				BIT31
#define PHIMR_TIMEOUT1				BIT30
#define PHIMR_PSTIMEOUT			BIT29
#define PHIMR_GTINT4				BIT28
#define PHIMR_GTINT3				BIT27
#define PHIMR_TXBCNERR				BIT26
#define PHIMR_TXBCNOK				BIT25
#define PHIMR_TSF_BIT32_TOGGLE	BIT24
#define PHIMR_BCNDMAINT3			BIT23
#define PHIMR_BCNDMAINT2			BIT22
#define PHIMR_BCNDMAINT1			BIT21
#define PHIMR_BCNDMAINT0			BIT20
#define PHIMR_BCNDOK3				BIT19
#define PHIMR_BCNDOK2				BIT18
#define PHIMR_BCNDOK1				BIT17
#define PHIMR_BCNDOK0				BIT16
#define PHIMR_HSISR_IND_ON			BIT15
#define PHIMR_BCNDMAINT_E			BIT14
#define PHIMR_ATIMEND_E			BIT13
#define PHIMR_ATIM_CTW_END		BIT12
#define PHIMR_HISRE_IND			BIT11	// RO. HISRE Indicator (HISRE & HIMRE is true, this bit is set to 1)
#define PHIMR_C2HCMD				BIT10
#define PHIMR_CPWM2				BIT9
#define PHIMR_CPWM					BIT8
#define PHIMR_HIGHDOK				BIT7		// High Queue DMA OK Interrupt
#define PHIMR_MGNTDOK				BIT6		// Management Queue DMA OK Interrupt
#define PHIMR_BKDOK					BIT5		// AC_BK DMA OK Interrupt
#define PHIMR_BEDOK					BIT4		// AC_BE DMA OK Interrupt
#define PHIMR_VIDOK					BIT3		// AC_VI DMA OK Interrupt
#define PHIMR_VODOK				BIT2		// AC_VO DMA Interrupt
#define PHIMR_RDU					BIT1		// Receive Descriptor Unavailable
#define PHIMR_ROK					BIT0		// Receive DMA OK Interrupt

// PCIE Host Interrupt Status Extension bit
#define PHIMR_BCNDMAINT7			BIT23
#define PHIMR_BCNDMAINT6			BIT22
#define PHIMR_BCNDMAINT5			BIT21
#define PHIMR_BCNDMAINT4			BIT20
#define PHIMR_BCNDOK7				BIT19
#define PHIMR_BCNDOK6				BIT18
#define PHIMR_BCNDOK5				BIT17
#define PHIMR_BCNDOK4				BIT16
// bit12 15: RSVD
#define PHIMR_TXERR					BIT11
#define PHIMR_RXERR					BIT10
#define PHIMR_TXFOVW				BIT9
#define PHIMR_RXFOVW				BIT8
// bit2-7: RSVD
#define PHIMR_OCPINT				BIT1
// bit0: RSVD

#define UHIMR_TIMEOUT2				BIT31
#define UHIMR_TIMEOUT1				BIT30
#define UHIMR_PSTIMEOUT			BIT29
#define UHIMR_GTINT4				BIT28
#define UHIMR_GTINT3				BIT27
#define UHIMR_TXBCNERR				BIT26
#define UHIMR_TXBCNOK				BIT25
#define UHIMR_TSF_BIT32_TOGGLE	BIT24
#define UHIMR_BCNDMAINT3			BIT23
#define UHIMR_BCNDMAINT2			BIT22
#define UHIMR_BCNDMAINT1			BIT21
#define UHIMR_BCNDMAINT0			BIT20
#define UHIMR_BCNDOK3				BIT19
#define UHIMR_BCNDOK2				BIT18
#define UHIMR_BCNDOK1				BIT17
#define UHIMR_BCNDOK0				BIT16
#define UHIMR_HSISR_IND			BIT15
#define UHIMR_BCNDMAINT_E			BIT14
//RSVD	BIT13
#define UHIMR_CTW_END				BIT12
//RSVD	BIT11
#define UHIMR_C2HCMD				BIT10
#define UHIMR_CPWM2				BIT9
#define UHIMR_CPWM					BIT8
#define UHIMR_HIGHDOK				BIT7		// High Queue DMA OK Interrupt
#define UHIMR_MGNTDOK				BIT6		// Management Queue DMA OK Interrupt
#define UHIMR_BKDOK				BIT5		// AC_BK DMA OK Interrupt
#define UHIMR_BEDOK				BIT4		// AC_BE DMA OK Interrupt
#define UHIMR_VIDOK					BIT3		// AC_VI DMA OK Interrupt
#define UHIMR_VODOK				BIT2		// AC_VO DMA Interrupt
#define UHIMR_RDU					BIT1		// Receive Descriptor Unavailable
#define UHIMR_ROK					BIT0		// Receive DMA OK Interrupt

// USB Host Interrupt Status Extension bit
#define UHIMR_BCNDMAINT7			BIT23
#define UHIMR_BCNDMAINT6			BIT22
#define UHIMR_BCNDMAINT5			BIT21
#define UHIMR_BCNDMAINT4			BIT20
#define UHIMR_BCNDOK7				BIT19
#define UHIMR_BCNDOK6				BIT18
#define UHIMR_BCNDOK5				BIT17
#define UHIMR_BCNDOK4				BIT16
// bit14-15: RSVD
#define UHIMR_ATIMEND_E			BIT13
#define UHIMR_ATIMEND				BIT12
#define UHIMR_TXERR					BIT11
#define UHIMR_RXERR					BIT10
#define UHIMR_TXFOVW				BIT9
#define UHIMR_RXFOVW				BIT8
// bit2-7: RSVD
#define UHIMR_OCPINT				BIT1
// bit0: RSVD


