WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/include/hal_com_reg.h
#define MASK_SDIO_HISR_CLEAR		(SDIO_HISR_TXERR |\
									SDIO_HISR_RXERR |\
									SDIO_HISR_TXFOVW |\
									SDIO_HISR_RXFOVW |\
									SDIO_HISR_TXBCNOK |\
									SDIO_HISR_TXBCNERR |\
									SDIO_HISR_C2HCMD |\
									SDIO_HISR_CPWM1 |\
									SDIO_HISR_CPWM2 |\
									SDIO_HISR_HSISR_IND |\
									SDIO_HISR_GTINT3_IND |\
									SDIO_HISR_GTINT4_IND |\
									SDIO_HISR_PSTIMEOUT |\
									SDIO_HISR_OCPINT)

// SDIO HCI Suspend Control Register
#define HCI_RESUME_PWR_RDY			BIT1
#define HCI_SUS_CTRL					BIT0

// SDIO Tx FIFO related
#define SDIO_TX_FREE_PG_QUEUE			4	// The number of Tx FIFO free page
#define SDIO_TX_FIFO_PAGE_SZ 			128

#ifdef CONFIG_SDIO_HCI
	#define MAX_TX_AGG_PACKET_NUMBER 	0x8
#else
	#define MAX_TX_AGG_PACKET_NUMBER 	0xFF
	#define MAX_TX_AGG_PACKET_NUMBER_8812 	64
#endif

//-----------------------------------------------------
//
//	0xFE00h ~ 0xFE55h	USB Configuration
//
//-----------------------------------------------------

//2 USB Information (0xFE17)
#define USB_IS_HIGH_SPEED			0
#define USB_IS_FULL_SPEED			1
#define USB_SPEED_MASK				BIT(5)

#define USB_NORMAL_SIE_EP_MASK	0xF
#define USB_NORMAL_SIE_EP_SHIFT	4

//2 Special Option
#define USB_AGG_EN				BIT(3)

// 0; Use interrupt endpoint to upload interrupt pkt
// 1; Use bulk endpoint to upload interrupt pkt,
#define INT_BULK_SEL			BIT(4)

//2REG_C2HEVT_CLEAR
#define C2H_EVT_HOST_CLOSE		0x00	// Set by driver and notify FW that the driver has read the C2H command message
#define C2H_EVT_FW_CLOSE		0xFF	// Set by FW indicating that FW had set the C2H command message and it's not yet read by driver.


//2REG_MULTI_FUNC_CTRL(For RTL8723 Only)
#define WL_HWPDN_EN			BIT0	// Enable GPIO[9] as WiFi HW PDn source
#define WL_HWPDN_SL			BIT1	// WiFi HW PDn polarity control
#define WL_FUNC_EN				BIT2	// WiFi function enable
#define WL_HWROF_EN			BIT3	// Enable GPIO[9] as WiFi RF HW PDn source
#define BT_HWPDN_EN			BIT16	// Enable GPIO[11] as BT HW PDn source
#define BT_HWPDN_SL			BIT17	// BT HW PDn polarity control
#define BT_FUNC_EN				BIT18	// BT function enable
#define BT_HWROF_EN			BIT19	// Enable GPIO[11] as BT/GPS RF HW PDn source
#define GPS_HWPDN_EN			BIT20	// Enable GPIO[10] as GPS HW PDn source
#define GPS_HWPDN_SL			BIT21	// GPS HW PDn polarity control
#define GPS_FUNC_EN			BIT22	// GPS function enable

//3 REG_LIFECTRL_CTRL
#define HAL92C_EN_PKT_LIFE_TIME_BK		BIT3
#define HAL92C_EN_PKT_LIFE_TIME_BE		BIT2
#define HAL92C_EN_PKT_LIFE_TIME_VI		BIT1
#define HAL92C_EN_PKT_LIFE_TIME_VO		BIT0

#define HAL92C_MSDU_LIFE_TIME_UNIT		128	// in us, said by Tim.

//2 8192D PartNo.
#define PARTNO_92D_NIC							(BIT7|BIT6)
#define PARTNO_92D_NIC_REMARK 				(BIT5|BIT4)
#define PARTNO_SINGLE_BAND_VS  				BIT3
#define PARTNO_SINGLE_BAND_VS_REMARK 		BIT1
#define PARTNO_CONCURRENT_BAND_VC 			(BIT3|BIT2)
#define PARTNO_CONCURRENT_BAND_VC_REMARK 	(BIT1|BIT0)

//========================================================
// General definitions
//========================================================

#define LAST_ENTRY_OF_TX_PKT_BUFFER_8188E(__Adapter)	   ( IS_VENDOR_8188E_I_CUT_SERIES(__Adapter) ? 255 : 175 )
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8812			255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8723B		255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_8192C		255
#define LAST_ENTRY_OF_TX_PKT_BUFFER_DUAL_MAC	127

#define POLLING_LLT_THRESHOLD				20
#if defined(CONFIG_RTL8723B) && defined(CONFIG_PCI_HCI)
#define POLLING_READY_TIMEOUT_COUNT		6000
#else
#define POLLING_READY_TIMEOUT_COUNT		1000
#endif


// GPIO BIT
#define	HAL_8812A_HW_GPIO_WPS_BIT	BIT2
#define	HAL_8192C_HW_GPIO_WPS_BIT	BIT2
#define	HAL_8192EU_HW_GPIO_WPS_BIT	BIT7
#define	HAL_8188E_HW_GPIO_WPS_BIT	BIT7

#endif //__HAL_COMMON_H__
